# Definitions & Basic Operations

**Dataframes:** a 2-dimensional data structure, which stores data in rows & columns

**Series/ series object:** a one-dimensional array with labels (index), based on NumPy ndarray. 

**Ndrray?:** An n-dimensional data structure that contains a group of elements - more efficient than Python lists - allow for use of vectorisation rather than loops (higher performance).

In [1]:
import pandas as pd

# I can create a pandas series from a dict. The keys are the indices.
dict={1: "a", 2: "b"}
dict1=pd.Series(dict)
print(dict1)

1    a
2    b
dtype: object

In [3]:
# I can also create a series from a list. Indeces are created automatically.

ls=[1,2,3]
ls1=pd.Series(ls)
print(ls1)

0    1
1    2
2    3
dtype: int64

In [4]:
# I can also create a series with indeces from scratch

oneD = pd.Series(["A","B","C"], index=[1,2,3])
print(oneD)

1    A
2    B
3    C
dtype: object

In [5]:
# I can access the data by index through loc

oneD.loc[1]

'A'

In [6]:
oneD.loc[[1,2]]

1    A
2    B
dtype: object

In [7]:
# I can use iloc to access the data by integer based index position

oneD.iloc[1]

'B'

In [11]:
# I can check whether an index is included in a series...

1 in oneD

True

In [12]:
#... but not a value

"B" in oneD

False

In [20]:
# I can create a dataframe from scratch using a dictionary

d={"Column A": pd.Series(["A","B","C"], index=[1,2,3]),
    "Column B": pd. Series(["D", "E", "F", "G"], index=[2,3,4,5])}

df=pd.DataFrame(d)
print(df)

  Column A Column B
1        A      NaN
2        B        D
3        C        E
4      NaN        F
5      NaN        G

In [21]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [23]:
# Get index values

df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [24]:
# Get column names

df.columns

Index(['Column A', 'Column B'], dtype='object')

In [29]:
# I can manipulate the dataframe to retain only a certain column/ index

pd.DataFrame(df, index=[1,2,3], columns=["Column B"])

  Column B
1      NaN
2        D
3        E

# Reading in Data

## Read in csv

In [32]:
file="C:\\Users\\franz\\Documents\\Git Repository\\data-science-training\\test_csv.csv" #Note,
# need to enter two backslashes

df=pd.read_csv(file)

df.head()

   Test 1  Test 2
0       1     500
1       2     600
2       3     700
3       4     800
4       5     900

In [42]:
# Sometimes, source data is not arranged in separate columns. If the separator is not a ",", then
# need to specify separator

file="test_csv 2.csv" #My file is saved in my working directory, which is in the project folder.

# I can check which folder I'm in like this:

import os
os.getcwd()

# Why not specify the whole path folder? I want to push the code to Github, so if I were t pull it
# onto another machine, then I would have to change the directory. This way, providing the input file
# is saved in my project folder, I can read it in without having to update the directory

'C:\\Users\\franz\\Documents\\Git Repository\\data-science-training'

In [41]:
df=pd.read_csv(file)

print(df)

  Test 1; Test 2
0         1; 500
1         2; 600
2         3; 700

In [35]:
df=pd.read_csv(file, sep=";")

print(df)

   Test 1   Test 2
0       1      500
1       2      600
2       3      700

## Read in txt files

Also use read_csv & specify separator like above

## Read in Excel files

In [45]:
df2=pd.read_excel("boston1.xls")

print(df2.head())

     MV  INDUS   NOX     RM  TAX    PT  LSTAT  Unnamed: 7  Unnamed: 8  \
0  24.0   2.31  53.8  6.575  296  15.3   4.98         NaN         NaN
1  21.6   7.07  46.9  6.421  242  17.8   9.14         NaN         NaN
2  34.7   7.07  46.9  7.185  242  17.8   4.03         NaN         NaN
3  33.4   2.18  45.8  6.998  222  18.7   2.94         NaN         NaN
4  36.2   2.18  45.8  7.147  222  18.7   5.33         NaN         NaN

                         Unnamed: 9
0    Subset of Boston housing tract
1    data of Harrison and Rubinfeld
2    (1978).  Each case is one U.S.
3  Census tract in the Boston area.
4                               NaN

In [47]:
# This file has multiple tabs. To load a specific tab, do the following:

# Load the Excel file

f=pd.ExcelFile("boston1.xls")

# Print the tab names

print(f.sheet_names)

['Sheet1', 'Sheet2']

In [49]:
# Load the rel. tab into a dataframe

df3=f.parse("Sheet1")

df3.head()

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN

## Read in html

This allows us to read data from webpages in as dataframes. Requires the library "hrml5lib", which does not come with Anaconda. To install:
1. Start Anaconda Prompt
2. Enter "conda install html5lib
3. When asked whether to proceed, enter "y"

Note: This is effectively webscraping

In [4]:
import pandas as pd

us_states=pd.read_html("https://simple.wikipedia.org/wiki/List_of_U.S._states")

print(us_states)

[   Name &postal abbs. [1]                          Unnamed: 2_level_0  \
   Name &postal abbs. [1] Name &postal abbs. [1].1 Unnamed: 2_level_1
0                 Alabama                      NaN                 AL
1                  Alaska                      NaN                 AK
2                 Arizona                      NaN                 AZ
3                Arkansas                      NaN                 AR
4              California                      NaN                 CA
5                Colorado                      NaN                 CO
6             Connecticut                      NaN                 CT
7                Delaware                      NaN                 DE
8                 Florida                      NaN                 FL
9                 Georgia                      NaN                 GA
10                 Hawaii                      NaN                 HI
11                  Idaho                      NaN                 ID
12               Illinois                      NaN                 IL
13                Indiana                      NaN                 IN
14                   Iowa                      NaN                 IA
15                 Kansas                      NaN                 KS
16            Kentucky[C]                      NaN                 KY
17              Louisiana                      NaN                 LA
18                  Maine                      NaN                 ME
19               Maryland                      NaN                 MD
20       Massachusetts[C]                      NaN                 MA
21               Michigan                      NaN                 MI
22              Minnesota                      NaN                 MN
23            Mississippi                      NaN                 MS
24               Missouri                      NaN                 MO
25                Montana                      NaN                 MT
26               Nebraska                      NaN                 NE
27                 Nevada                      NaN                 NV
28          New Hampshire                      NaN                 NH
29             New Jersey                      NaN                 NJ
30             New Mexico                      NaN                 NM
31               New York                      NaN                 NY
32         North Carolina                      NaN                 NC
33           North Dakota                      NaN                 ND
34                   Ohio                      NaN                 OH
35               Oklahoma                      NaN                 OK
36                 Oregon                      NaN                 OR
37        Pennsylvania[C]                      NaN                 PA
38           Rhode Island                      NaN                 RI
39         South Carolina                      NaN                 SC
40           South Dakota                      NaN                 SD
41              Tennessee                      NaN                 TN
42                  Texas                      NaN                 TX
43                   Utah                      NaN                 UT
44                Vermont                      NaN                 VT
45            Virginia[C]                      NaN                 VA
46             Washington                      NaN                 WA
47          West Virginia                      NaN                 WV
48              Wisconsin                      NaN                 WI
49                Wyoming                      NaN                 WY

            Cities                            Established[A] Population[B][3]  \
           Capital Largest (by population)[5] Established[A] Population[B][3]
0       Montgomery                 Birmingham   Dec 14, 1819          4903185
1           Juneau                  Anchorage    Jan 3, 1959           731545
2          Phoenix                    Phoenix   Feb 14, 1912          7278717
3      Little Rock                Little Rock   Jun 15, 1836          3017804
4       Sacramento                Los Angeles    Sep 9, 1850         39512223
5           Denver                     Denver    Aug 1, 1876          5758736
6         Hartford                 Bridgeport    Jan 9, 1788          3565278
7            Dover                 Wilmington    Dec 7, 1787           973764
8      Tallahassee               Jacksonville    Mar 3, 1845         21477737
9          Atlanta                    Atlanta    Jan 2, 1788         10617423
10        Honolulu                   Honolulu   Aug 21, 1959          1415872
11           Boise                      Boise    Jul 3, 1890          1787065
12     Springfield                    Chicago    Dec 3, 1818         12671821
13    Indianapolis               Indianapolis   Dec 11, 1816          6732219
14      Des Moines                 Des Moines   Dec 28, 1846          3155070
15          Topeka                    Wichita   Jan 29, 1861          2913314
16       Frankfort                 Louisville    Jun 1, 1792          4467673
17     Baton Rouge                New Orleans   Apr 30, 1812          4648794
18         Augusta                   Portland   Mar 15, 1820          1344212
19       Annapolis                  Baltimore   Apr 28, 1788          6045680
20          Boston                     Boston    Feb 6, 1788          6892503
21         Lansing                    Detroit   Jan 26, 1837          9986857
22        St. Paul                Minneapolis   May 11, 1858          5639632
23         Jackson                    Jackson   Dec 10, 1817          2976149
24  Jefferson City                Kansas City   Aug 10, 1821          6137428
25          Helena                   Billings    Nov 8, 1889          1068778
26         Lincoln                      Omaha    Mar 1, 1867          1934408
27     Carson City                  Las Vegas   Oct 31, 1864          3080156
28         Concord                 Manchester   Jun 21, 1788          1359711
29         Trenton                     Newark   Dec 18, 1787          8882190
30        Santa Fe                Albuquerque    Jan 6, 1912          2096829
31          Albany                   New York   Jul 26, 1788         19453561
32         Raleigh                  Charlotte   Nov 21, 1789         10488084
33        Bismarck                      Fargo    Nov 2, 1889           762062
34        Columbus                   Columbus    Mar 1, 1803         11689100
35   Oklahoma City              Oklahoma City   Nov 16, 1907          3956971
36           Salem                   Portland   Feb 14, 1859          4217737
37      Harrisburg               Philadelphia   Dec 12, 1787         12801989
38      Providence                 Providence   May 29, 1790          1059361
39        Columbia                 Charleston   May 23, 1788          5148714
40          Pierre                Sioux Falls    Nov 2, 1889           884659
41       Nashville                  Nashville    Jun 1, 1796          6829174
42          Austin                    Houston   Dec 29, 1845         28995881
43  Salt Lake City             Salt Lake City    Jan 4, 1896          3205958
44      Montpelier                 Burlington    Mar 4, 1791           623989
45        Richmond             Virginia Beach   Jun 25, 1788          8535519
46         Olympia                    Seattle   Nov 11, 1889          7614893
47      Charleston                 Charleston   Jun 20, 1863          1792147
48         Madison                  Milwaukee   May 29, 1848          5822434
49        Cheyenne                   Cheyenne   Jul 10, 1890           578759

   Total area[4]          Land area[4]          Water area[4]          \
             mi2      km2          mi2      km2           mi2     km2
0          52420   135767        50645   131171          1775    4597
1         665384  1723337       570641  1477953         94743  245384
2         113990   295234       113594   294207           396    1026
3          53179   137732        52035   134771          1143    2961
4         163695   423967       155779   403466          7916   20501
5         104094   269601       103642   268431           452    1170
6           5543    14357         4842    12542           701    1816
7           2489     6446         1949     5047           540    1399
8          65758   170312        53625   138887         12133   31424
9          59425   153910        57513   148959          1912    4951
10         10932    28313         6423    16635          4509   11678
11         83569   216443        82643   214045           926    2398
12         57914   149995        55519   143793          2395    6202
13         36420    94326        35826    92789           593    1537
14         56273   145746        55857   144669           416    1077
15         82278   213100        81759   211754           520    1346
16         40408   104656        39486   102269           921    2387
17         52378   135659        43204   111898          9174   23761
18         35380    91633        30843    79883          4537   11750
19         12406    32131         9707    25142          2699    6990
20         10554    27336         7800    20202          2754    7134
21         96714   250487        56539   146435         40175  104052
22         86936   225163        79627   206232          7309   18930
23         48432   125438        46923   121531          1508    3907
24         69707   180540        68742   178040           965    2501
25        147040   380831       145546   376962          1494    3869
26         77348   200330        76824   198974           524    1356
27        110572   286380       109781   284332           791    2048
28          9349    24214         8953    23187           397    1027
29          8723    22591         7354    19047          1368    3544
30        121590   314917       121298   314161           292     757
31         54555   141297        47126   122057          7429   19240
32         53819   139391        48618   125920          5201   13471
33         70698   183108        69001   178711          1698    4397
34         44826   116098        40861   105829          3965   10269
35         69899   181037        68595   177660          1304    3377
36         98379   254799        95988   248608          2391    6191
37         46054   119280        44743   115883          1312    3397
38          1545     4001         1034     2678           511    1324
39         32020    82933        30061    77857          1960    5076
40         77116   199729        75811   196350          1305    3379
41         42144   109153        41235   106798           909    2355
42        268596   695662       261232   676587          7365   19075
43         84897   219882        82170   212818          2727    7064
44          9616    24906         9217    23871           400    1035
45         42775   110787        39490   102279          3285    8508
46         71298   184661        66456   172119          4842   12542
47         24230    62756        24038    62259           192     497
48         65496   169635        54158   140268         11339   29367
49         97813   253335        97093   251470           720    1864

   Numberof Reps.
   Numberof Reps.
0               7
1               1
2               9
3               4
4              53
5               7
6               5
7               1
8              27
9              14
10              2
11              2
12             18
13              9
14              4
15              4
16              6
17              6
18              2
19              8
20              9
21             14
22              8
23              4
24              8
25              1
26              3
27              4
28              2
29             12
30              3
31             27
32             13
33              1
34             16
35              5
36              5
37             18
38              2
39              7
40              1
41              9
42             36
43              4
44              1
45             11
46             10
47              3
48              8
49              1  ]

In [5]:
print(type(us_states)) # This is a list of dataframes. I need to grab the dataframe at index 0 & store as variable

<class 'list'>

In [9]:
df4=us_states[0]

print(df4.head())

  Name &postal abbs. [1]                          Unnamed: 2_level_0  \
  Name &postal abbs. [1] Name &postal abbs. [1].1 Unnamed: 2_level_1
0                Alabama                      NaN                 AL
1                 Alaska                      NaN                 AK
2                Arizona                      NaN                 AZ
3               Arkansas                      NaN                 AR
4             California                      NaN                 CA

        Cities                            Established[A] Population[B][3]  \
       Capital Largest (by population)[5] Established[A] Population[B][3]
0   Montgomery                 Birmingham   Dec 14, 1819          4903185
1       Juneau                  Anchorage    Jan 3, 1959           731545
2      Phoenix                    Phoenix   Feb 14, 1912          7278717
3  Little Rock                Little Rock   Jun 15, 1836          3017804
4   Sacramento                Los Angeles    Sep 9, 1850         39512223

  Total area[4]          Land area[4]          Water area[4]          \
            mi2      km2          mi2      km2           mi2     km2
0         52420   135767        50645   131171          1775    4597
1        665384  1723337       570641  1477953         94743  245384
2        113990   295234       113594   294207           396    1026
3         53179   137732        52035   134771          1143    2961
4        163695   423967       155779   403466          7916   20501

  Numberof Reps.
  Numberof Reps.
0              7
1              1
2              9
3              4
4             53

### What if I have more than one table on the website?

In [10]:
# This site contains 2 lists of Philippines world heritage sites

whs=pd.read_html("https://en.wikipedia.org/wiki/List_of_World_Heritage_Sites_in_the_Philippines")

# To get the first table:
df5=whs[0]

df5.head()

,Site,Site.1,Location,Regions,UNESCO data,Period,Description,Ref
0,Baroque Churches of the Philippines: San Agust...,NaN,City of Manila; Ilocos Sur; Ilocos Norte; Iloilo,Manila; Ilocandia; Western Visayas,"1993 (inscription), 2013 (minor boundary modif...",16th century,All of the four baroque churches have been dec...,[5]
1,Tubbataha Reefs Natural Park,NaN,Palawan,Mimaropa,"1993 (inscription), 2009 (extension); vii, ix, x",Pleistocene Epoch,"The site is an ASEAN Heritage Park, and a Rams...",[6]
2,Rice Terraces of the Philippine Cordilleras: B...,NaN,Ifugao,Cordillera,"1995 (inscription); iii, iv, v",16th century,"The inscription includes 5 properties, namely,...",[7]
3,Historic City of Vigan,NaN,Ilocos Sur,Ilocandia,"1999 (inscription); ii, iv",16th century,The site is also one of the New7Wonders Cities...,[8]
4,Puerto Princesa Subterranean River National Park,NaN,Palawan,Mimaropa,"1999 (inscription); vii, x",Pleistocene Epoch,"The site is one of the New7Wonders of Nature, ...",[9]

In [11]:
# To get the 2nd table:

df6=whs[1]

print(df6.head())

                 Type (criteria)  \
0          Natural: (vii)(ix)(x)
1  Cultural: (i)(iii)(iv)(v)(vi)
2                          Mixed
3         Cultural: (iii)(iv)(v)
4           Natural: (vii)(viii)

                                                Site           Location  \
0                              Apo Reef Natural Park           Sulu Sea
1  Baroque Churches of the Philippines (Extension...  Various Locations
2         Batanes Protected Landscapes and Seascapes            Batanes
3                         Butuan Archeological Sites   Agusan del Norte
4                   Chocolate Hills Natural Monument              Bohol

                         Period  \
0             Pleistocene Epoch
1        18th to 19th centuries
2  Pleistocene Epoch and 100 AD
3                  10th century
4             Pleistocene Epoch

                                         Description  Image   Ref
0  The site is the second biggest producer of juv...    NaN  [12]
1  All five baroque churches have been declared a...    NaN  [13]
2  The Mahatao Church of Batanes is a declared Na...    NaN  [14]
3  The site exemplified and concretized the capab...    NaN  [15]
4  The site is the focal property of the proposed...    NaN  [16]